export const textSite = [
  {
    id: 0,
    textImg: "",
    title: "다이슨",
    date: "07.20 ~ 09.08",
    tool: "javascript, react, react-hook / AdobeXD",
    desc: "기존의 다이슨 코리아 사이트를 리뉴얼하였습니다. 저를 포함한 조원 4명이 진행하였으며, 저는 '디자인과 코딩(커뮤니티 전체 페이지, 제품 페이지 기능, 제품디테일 페이지 기능, 전체 페이지 디테일 및 기능 수정)'을 담당하였습니다. ",
    end: "기간 안에 끝내는 것과 여러 인원이 작업할 시 최종 결정을 담당하는 역할이 필요하다는 것을 느꼈습니다. ",
  },
  {
    id: 1,
    textImg: "",
    title: "서울식물원",
    date: "05.09 ~ 06.13",
    tool: "html5, css / AdobeXD",

    desc: "기존의 서울식물원 사이트를 리뉴얼하였습니다. 저를 포함한 조원 3명이 진행하였으며, 저는 '디자인과 코딩(온실안내 페이지)'을 담당하였습니다. ",
    end: "디자인의 대부분을 저 혼자 진행했기 때문에 막히는 부분이 종종 있었지만 후반 작업에서 다른 사람들에게 피드백을 구하면서 여러 의견의 중요성을 알게 되었습니다. 디자인을 할 때 코드작업은 고려를 하지 못해서 여러모로 아쉬움이 남았던 작업입니다.",
  },
  {
    id: 2,
    textImg: "",
    title: "영화 사이트 (Heving)",
    date: "09.",
    tool: "javascript, react, react-hook / AdobeXD",

    desc: "저 혼자 진행한 영화 및 TV프로그램 다시보기 사이트입니다. 기존 영화 사이트에서 API를 받아와 저만의 사이트를 만들었습니다. ",
    end: "다른 곳에서 API를 끌어와 코드에 적용시키는 방법과 리액트의 여러 기능들을 배울 수 있었던 프로젝트였습니다. 오류를 해결하는 것에 뿌듯함을 크게 느꼈습니다.",
  },
];

export const textToy = [
  {
    id: 0,
    textImg: "",
    title: "로그인 / 회원가입",
    date: "09.",
    tool: "javascript, react, react-hook",

    desc: "저 혼자 진행한 토이프로젝트입니다. ",
    end: "간편한 코드로도 쉽게 로그인과 회원가입 기능을 할 수 있다는 것과 인터렉티브한 움직임을 의도한 대로 넣는 방법을 알게 되었습니다.",
  },
  {
    id: 1,
    textImg: "",
    title: "장바구니",
    date: "09.",
    tool: "javascript, react, react-hook",

    desc: "저 혼자 진행한 토이프로젝트입니다. ",
    end: "여러 방법들을 찾던 도중 로그인 프로젝트에 썼던 기능으로 쉽게 장바구니를 구현할 수 있다는 것을 깨달았습니다.",
  },
  {
    id: 2,
    textImg: "",
    title: "장바구니",
    date: "09.",
    tool: "javascript, react, react-hook",

    desc: "저 혼자 진행한 토이프로젝트입니다. ",
    end: "여러 방법들을 찾던 도중 로그인 프로젝트에 썼던 기능으로 쉽게 장바구니를 구현할 수 있다는 것을 깨달았습니다.",
  },
];
